Examples/rigidCircularCylinder_3DoFs/0/motionScale
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointScalarField;
    location    "0";
    object      motionScale;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
29040
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
    }
    outlet
    {
        type            calculated;
    }
    cylinder
    {
        type            calculated;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
